#### Terraform Plan 📖`success`



<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.membership_for_some_user will be created
  + resource "github_membership" "membership_for_some_user" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "SomeUser"
    }

  # github_membership.membership_for_some_user1 will be created
  + resource "github_membership" "membership_for_some_user1" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "SomeUser1"
    }

  # github_membership.membership_for_some_user2 will be created
  + resource "github_membership" "membership_for_some_user2" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "SomeUser2"
    }

  # github_membership.membership_for_some_user3 will be created
  + resource "github_membership" "membership_for_some_user3" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hogefoobarhoge"
    }

  # github_membership.membership_for_some_user4 will be created
  + resource "github_membership" "membership_for_some_user4" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "example_test_user"
    }

  # github_repository_collaborator.a_repo_collaborator will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "our-cool-repo"
      + username                    = "SomeUser"
    }

  # github_repository_collaborator.a_repo_collaborator2 will be created
  + resource "github_repository_collaborator" "a_repo_collaborator2" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "our-cool-repo"
      + username                    = "SomeUser2"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>